
## Plan Result

[CI link](https://github.com/scarowar/test-terraform-branch-deploy/actions/runs/21106762976)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.fixed
  * local_file.test


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.fixed will be created
  + resource "local_file" "fixed" {
      + content              = "fixed"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/tmp/fixed.txt"
      + id                   = (known after apply)
    }

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: dev
            Message: Development environment test
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment = "dev"
  + file_path   = "./output.txt"
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":151,"Program":"tfcmt","SHA1":"25747efbd324daa089dc9942515dba7aadf910c6","Vars":{},"WorkflowName":"Terraform Deploy"} -->